packages/dategen/dategen-1.0.1.tar.gz/dategen-1.0.1/log.org

** 40
:PROPERTIES:
:EXPORT_FILE_NAME: README.md
:END:


Dategen is a python package that yield a generator of dates.

*** Install

#+BEGIN_EXAMPLE
$ python3 -m pip install dategen
#+END_EXAMPLE

*** Usage

#+BEGIN_SRC
import dategen
g = dategen.dategen.backward
help(g)
#+END_SRC

#+BEGIN_SRC
x=g()
#+END_SRC

#+BEGIN_SRC
# only the last command will be displayed.

# type( x )  # generator

# list( x )  # 5000 datetime, a very long list.

# next( x )  # one datetime form the generator

# len( list(x) )  # 5000
#+END_SRC
    

*** folder structures


 #+HEADERS: :results raw
 #+BEGIN_SRC sh

   date

   tree

 #+END_SRC

 #+RESULTS:
 Fri Jul 23 17:57:13 CST 2021
 .
 ├── LICENSE
 ├── Pipfile
 ├── Pipfile.lock
 ├── README.md
 ├── Untitled.ipynb
 ├── Untitled1.ipynb
 ├── dategen
 │   ├── __init__.py
 │   └── dategen.py
 ├── log.org
 ├── pyproject.toml
 └── tests
     └── dategen.ipynb


